// 数据字典
// 以下几个只有病害全景在引用，若全景废弃，文件可删
// 病害紧急程度
export const diseaseUrgency = {
  0: '紧急',
  9: '紧急',
  11: '紧急',
  80: '紧急',
  24: '紧急',
  21: '紧急',
  82: '紧急',
  12: '紧急',

  1: '非紧急',
  2: '非紧急',
  3: '非紧急',
  4: '非紧急',
  7: '非紧急',
  8: '非紧急',
  10: '非紧急',
  13: '非紧急',
  14: '非紧急',
  81: '非紧急',
  22: '非紧急',
  23: '非紧急',
  20: '非紧急',
  83: '非紧急',
};

// 沥青
export const disease1 = {
  0: '坑槽', // 坑槽
  1: '纵向裂缝', // 纵向裂缝
  2: '横向裂缝', // 横向裂缝
  3: '修补', // 修补
  4: '龟裂', // 龟裂
  7: '块状裂缝', // 块状裂缝
  8: '啃边', // 啃边
  13: '松散', // 松散
  80: '沉陷', // 沉陷
  81: '泛油', // 泛油
};
// 水泥
export const disease2 = {
  // 13: '坑洞', // 坑洞
  // 14: '面板破碎', // 面板破碎
  // 17: '板角断裂', // 板角断裂
  // 18: '裂缝', // 裂缝
  // 19: '边角剥落', // 边角剥落

  20: '边角剥落', // 边角剥落
  21: '面板破碎', // 面板破碎
  22: '板角断裂', // 板角断裂
  23: '裂缝', // 裂缝
  24: '坑洞', // 坑洞
};
// 综合安全事件
export const disease3 = {
  9: '护栏损坏', // 护栏损坏
  10: '路框差', // 路框差
  11: '井盖破损', // 井盖破损
  12: '交通标志损坏',
  82: '抛洒物', // 抛洒物
  83: '积水', // 积水
  14: '路面跳车',
};
// // 病害类型
// export const diseaseObj = {
//   0: '坑槽', // 坑槽
//   1: '纵向裂缝', // 纵向裂缝
//   2: '横向裂缝', // 横向裂缝
//   3: '修补', // 修补
//   4: '龟裂', // 龟裂
//   7: '块状裂缝', // 块状裂缝
//   8: '啃边', // 啃边
//   80: '沉陷', // 沉陷
//   81: '泛油', // 泛油

//   24: '坑洞', // 坑洞
//   21: '面板破碎', // 面板破碎
//   22: '板角断裂', // 板角断裂
//   23: '裂缝', // 裂缝
//   20: '边角剥落', // 边角剥落

//   9: '护栏损坏', // 护栏损坏
//   10: '路框差', // 路框差
//   11: '井盖破损', // 井盖破损
//   12: '交通标志损坏',
//   13: '松散', // 松散
//   82: '抛洒物', // 抛洒物
//   83: '积水', // 积水
//   14: '路面跳车',
// };

// // 病害类型全部--加前缀
// export const diseaseAll = {
//   0: '沥青路面-坑槽',
//   1: '沥青路面-纵向裂缝',
//   2: '沥青路面-横向裂缝',
//   3: '沥青路面-修补',
//   4: '沥青路面-龟裂',
//   7: '沥青路面-块状裂缝',
//   8: '沥青路面-啃边',
//   9: '护栏损坏',
//   10: '路框差',
//   11: '井盖破损',
//   // 紧急
//   80: '沥青路面-沉陷',
//   24: '水泥路面-坑洞',
//   21: '水泥路面-面板破碎',
//   82: '抛洒物',
//   12: '交通标志损坏',
//   // 非紧急
//   13: '沥青路面-松散', // 松散
//   81: '沥青路面-泛油',
//   22: '水泥路面-板角断裂',
//   23: '水泥路面-裂缝',
//   20: '水泥路面-边角剥落',
//   83: '积水',
//   14: '路面跳车',
// };
// // 任务管理针对模型为农村单车道添加的类型
// export const byTypes = {
//   // 农村单车道新增
//   15: '波浪拥包',
//   16: '条状修补',
//   17: '块状修补',
//   25: '错台',
//   26: '拱起',
//   27: '接缝料损坏',
//   28: '唧泥',
//   29: '露骨',
// };
// // 紧急--加前缀
// export const diseaseUrgency1 = {
//   0: '沥青路面-坑槽',
//   9: '护栏损坏',
//   11: '井盖破损',
//   12: '交通标志损坏',
//   80: '沥青路面-沉陷',
//   24: '水泥路面-坑洞',
//   21: '水泥路面-面板破碎',
//   82: '抛洒物',
// };

// // 非紧急--加前缀
// export const diseaseUrgency2 = {
//   1: '沥青路面-纵向裂缝',
//   2: '沥青路面-横向裂缝',
//   3: '沥青路面-修补',
//   4: '沥青路面-龟裂',
//   7: '沥青路面-块状裂缝',
//   8: '沥青路面-啃边',
//   10: '路框差',
//   13: '沥青路面-松散', // 松散
//   81: '沥青路面-泛油',
//   22: '水泥路面-板角断裂',
//   23: '水泥路面-裂缝',
//   20: '水泥路面-边角剥落',
//   83: '积水',
//   14: '路面跳车',
// };

// // 紧急
// export const diseaseUrgency3 = {
//   0: '坑槽',
//   9: '护栏损坏',
//   11: '井盖破损',
//   12: '交通标志损坏',
//   80: '沉陷',
//   24: '坑洞',
//   21: '面板破碎',
//   82: '抛洒物',
// };

// // 非紧急
// export const diseaseUrgency4 = {
//   1: '纵向裂缝',
//   2: '横向裂缝',
//   3: '修补',
//   4: '龟裂',
//   7: '块状裂缝',
//   8: '啃边',
//   10: '路框差',
//   13: '松散', // 松散
//   81: '泛油',
//   22: '板角断裂',
//   23: '裂缝',
//   20: '边角剥落',
//   83: '积水',
//   14: '路面跳车',
// };

// 病害类型全部--加前缀, 目前只有去重调试工具在用，废弃后可删除
export const diseaseAll1 = [
  { label: '沥青路面-坑槽', value: 0 },
  { label: '沥青路面-纵向裂缝', value: 1 },
  { label: '沥青路面-横向裂缝', value: 2 },
  { label: '沥青路面-修补', value: 3 },
  { label: '沥青路面-龟裂', value: 4 },
  { label: '沥青路面-块状裂缝', value: 7 },
  { label: '沥青路面-啃边', value: 8 },
  { label: '护栏损坏', value: 9 },
  { label: '路框差', value: 10 },
  { label: '井盖破损', value: 11 },
  // 紧急
  { label: '沥青路面-沉陷', value: 80 },
  { label: '水泥路面-坑洞', value: 24 },
  { label: '水泥路面-面板破碎', value: 21 },
  { label: '抛洒物', value: 82 },
  { label: '交通标志损坏', value: 12 },
  // 非紧急
  { label: '沥青路面-泛油', value: 81 },
  { label: '水泥路面-板角断裂', value: 22 },
  { label: '水泥路面-裂缝', value: 23 },
  { label: '水泥路面-边角剥落', value: 20 },
  { label: '积水', value: 83 },
  { label: '沥青路面-松散', value: 13 },
  { label: '路面跳车', value: 14 },
];

// // 病害类型全部
// export const diseaseAll2 = [
//   { label: '坑槽', value: 0 },
//   { label: '纵向裂缝', value: 1 },
//   { label: '横向裂缝', value: 2 },
//   { label: '修补', value: 3 },
//   { label: '龟裂', value: 4 },
//   { label: '块状裂缝', value: 7 },
//   { label: '啃边', value: 8 },
//   { label: '护栏损坏', value: 9 },
//   { label: '路框差', value: 10 },
//   { label: '井盖破损', value: 11 },
//   // 紧急
//   { label: '沉陷', value: 80 },
//   { label: '交通标志损坏', value: 12 },
//   { label: '坑洞', value: 24 },
//   { label: '面板破碎', value: 21 },
//   { label: '抛洒物', value: 82 },
//   // 非紧急
//   { label: '泛油', value: 81 },
//   { label: '板角断裂', value: 22 },
//   { label: '裂缝', value: 23 },
//   { label: '边角剥落', value: 20 },
//   { label: '积水', value: 83 },
//   { label: '松散', value: 13 },
//   { label: '路面跳车', value: 14 },
// ];
// 看板界面的多选树框
// export const diseaseTypeList: any = [
//   {
//     title: '全部',
//     value: 10000,
//     key: 10000,
//     children: [
//       {
//         title: '沥青路面',
//         value: 1001,
//         key: 1001,
//         children: [
//           {
//             title: '坑槽',
//             value: 0,
//             key: 0,
//           },
//           {
//             title: '纵向裂缝',
//             value: 1,
//             key: 1,
//           },
//           {
//             title: '横向裂缝',
//             value: 2,
//             key: 2,
//           },
//           {
//             title: '修补',
//             value: 3,
//             key: 3,
//           },
//           {
//             title: '龟裂',
//             value: 4,
//             key: 4,
//           },
//           {
//             title: '块状裂缝',
//             value: 7,
//             key: 7,
//           },
//           {
//             title: '啃边',
//             value: 8,
//             key: 8,
//           },
//           {
//             title: '松散',
//             value: 13,
//             key: 13,
//           },
//           {
//             title: '沉陷',
//             value: 80,
//             key: 80,
//           },
//           {
//             title: '泛油',
//             value: 81,
//             key: 81,
//           },
//         ],
//       },
//       {
//         title: '水泥路面',
//         value: 1002,
//         key: 1002,
//         children: [
//           {
//             title: '坑洞',
//             value: 24,
//             key: 24,
//           },
//           {
//             title: '面板破碎',
//             value: 21,
//             key: 21,
//           },
//           {
//             title: '板角断裂',
//             value: 22,
//             key: 22,
//           },
//           {
//             title: '裂缝',
//             value: 23,
//             key: 23,
//           },
//           {
//             title: '边角剥落',
//             value: 20,
//             key: 20,
//           },
//         ],
//       },
//       {
//         title: '综合安全事件',
//         value: 1003,
//         key: 1003,
//         children: [
//           {
//             title: '护栏损坏',
//             value: 9,
//             key: 9,
//           },
//           {
//             title: '路框差',
//             value: 10,
//             key: 10,
//           },
//           {
//             title: '井盖破损',
//             value: 11,
//             key: 11,
//           },
//           {
//             title: '交通标志损坏',
//             value: 12,
//             key: 12,
//           },
//           {
//             title: '抛洒物',
//             value: 82,
//             key: 82,
//           },
//           {
//             title: '积水',
//             value: 83,
//             key: 83,
//           },
//           {
//             title: '路面跳车',
//             value: 14,
//             key: 14,
//           },
//         ],
//       },
//       {
//         title: '-1',
//         value: -1,
//         key: -1,
//       },
//     ],
//   },
// ];
